package LessonClass4;

public class ClassLesson {

    //Программа на Java состоит из совокупности объектов
    // При этом - каждый объект - экземпляр определённого класса
    /* 1. На коценптульном уровне Выделяем объекты и связи между ними
    каждый тип объекта имеет свою строго определённую сферу ответсвенности. объекты
    сами несут ответсвенность за своё поведение
    *  2. описываем классы
    в классах перечисляем все свойства(характеристика) объекта, и методы
    длина, цвет свойство
    50 метров, красный - значение свойства
    *  3. Создаём объекты.
    задача система учёта книг в библиотеке.
    для каждой книги дб указаны:
    автор
    название
    можно ли брать на дом или только читать в зале
    доступность книги.

    Книги хранятся в библиотеке
    в библиоткеу можно добавить одну книгу
    можно добавить несколько книг
    должна быть возможность получить информацию по книге, указав её название
    (автор, название, можно ли забрать, доступность)
    если книга не найдена, сообщаем что такой книги нет.

    должна быть возможность взять эту книгу на дом, указав название
    должна быть возможность почитать книгу в читальном зале, указав название



    *  4.
    * */
}
